// 1) Даны два массива: ['a', 'b', 'c'] и [1, 2, 3]. Объедините их вместе.
// 2) Дан массив ['a', 'b', 'c']. Добавьте ему в конец элементы 1, 2, 3.
// 3) Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].
// 4) Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [1, 2, 3].
// 5)Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].
// const a = [1, 2, 3, 4, 5];

// let a = ['a', 'b', 'c'];
// let b = [1, 2, 3];
// // 1) 
// let c = a.concat(b);
// console.log(c);
// // 2)
// a.push(1, 2, 3);
// console.log(a);
// // 3)
// b.reverse('');
// console.log(b);
// // 4)
// let d = [1, 2, 3, 4, 5];
// d = d.slice(0, 3);
// console.log(d);
// 5)
// let f = [1, 2, 3, 4, 5];
// f.splice(1, 2);
// console.log(f);



// 1) Вибираємо випадкове число (від 0 до довжини масива);
// const a = [1, 2, 3, 4, 5];
// let b = Math.floor(Math.random() * a.length);
// console.log(a[b]);

// 2)// -) Записуємо в змінну строку з промта
// -) Зробити строку масивом
// -) Скопіювати масив в нову змінну
// -) Реверсимо масив 
// -) З масивів робимо строки
let a = prompt('Enter data');

let b = a.split(' ');
console.log(b);
b.reverse('');
console.log(b);

b.toString(' ');
console.log(b);

a.toString(' ');
console.log(b);

console.log(a, b);
